class FoodData {
  static Map<String, Map<String, dynamic>> foods = {
    "ข้าวผัด": {
      "price": 40,
      "lat": 18.28439079855507,
      "lng": 99.51069508042555,
      "video": "assets/videos/cookk.mp4",
      "ingredients": ["ข้าวที่แช่เย็น", "ไข่ไก่", "รสดี", "ผงชูรส"],
      "steps": ["ผัดข้าว", "ใส่ไข่", "จัดจาน"],
    },
    "กระเพราะหมูสับ": {
      "price": 40,
      "lat": 18.28507961448529,
      "lng": 99.50030618222888,
      "video": "assets/videos/cookk1.mp4",
      "ingredients": ["หมูสับ", "ใบกระเพราะ"],
      "steps": ["ผัด"],
    },
    "ต้มยำกุ้ง": {
      "price": 40,
      "lat": 18.281872538846898,
      "lng": 99.49810089620242,
      "video": "assets/videos/cookk3.mp4",
      "ingredients": ["กุ้ง", "ตะไคร้"],
      "steps": ["ต้ม", "ปรุงรส"],
    },
    "ราเมง": {
      "price": 40,
      "lat": 18.289778913477118,
      "lng": 99.49624267024736,
      "video": "assets/videos/cookk2.mp4",
      "ingredients": ["เส้นราเมง", "น้ำซุป"],
      "steps": ["ต้มน้ำซุป", "นำเส้นลงไปต้ม"],
    },
    "ไอศกรีม": {
      "price": 10,
      "lat": 18.293615949923243,
      "lng": 99.50515480037005,
      "video": "assets/videos/cookkk.mp4",
      "ingredients": ["น้ำผลไม้ (ตามชอบ)", "ชิ้นผลไม้สด", "โยเกิร์ต"],
      "steps": ["ปั่นโยเกิร์ต", "เทใส่พิมพ์และแช่แข็ง 7-8 ชั่วโมง"],
    },
    "บิงซู": {
      "price": 40,
      "lat": 18.28664968701462,
      "lng": 99.5040438291449,
      "video": "assets/videos/cookkk1.mp4",
      "ingredients": ["นมสด", "นมข้นหวาน", "ท็อปปิ้ง"],
      "steps": ["ผสมเบสนม", "แช่แข็ง", "ทำเกล็ดหิมะ", "จัดเสิร์ฟ"],
    },
    "ขนมปัง": {
      "price": 20,
      "lat": 18.282254072731934,
      "lng": 99.50429981534556,
      "video": "assets/videos/cookkk2.mp4",
      "ingredients": ["แป้งขนมปัง", "ยีสต์แห้ง", "เกลือ", "น้ำอุ่น (หรือนมอุ่นเพื่อความนุ่ม)" ],
      "steps": ["อบ"],
    },
  };
}

